Revit 2027 API
BuiltInFailures.SketchFailures.SketchOverconstrainedWarn Property
 Sketch is overconstrained.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SketchOverconstrainedWarn { get; }
Public Shared ReadOnly Property SketchOverconstrainedWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SketchOverconstrainedWarn {
	FailureDefinitionId^ get ();
}
static member SketchOverconstrainedWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace